<a href="https://colab.research.google.com/github/armandovl/funciones_descriptiva/blob/main/tablas_distribucion_frecuencia_funcion.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
## Importar las librerías de cajón
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [ ]:
#importamos el data frame
titanic=sns.load_dataset("titanic")
titanic.head(4)

   survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0         0       3    male  22.0  ...   NaN  Southampton     no  False
1         1       1  female  38.0  ...     C    Cherbourg    yes  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True
3         1       1  female  35.0  ...     C  Southampton    yes  False

[4 rows x 15 columns]

In [ ]:
#dejar solo algunas variables categóricas
titanic_nuevo=titanic[["survived","pclass","sex","alone"]]#todas las demas

#creamos un nuevo data frame donde nuestras variables ya serán categoricas
#incluso podemos cambiar los nombres
titanic_nuevo2=pd.DataFrame()
titanic_nuevo2["sobrevivientes"]=pd.Categorical(titanic_nuevo["survived"])
titanic_nuevo2["clase"]=pd.Categorical(titanic_nuevo["pclass"])
titanic_nuevo2["genero"]=pd.Categorical(titanic_nuevo["sex"])
titanic_nuevo2["estado"]=pd.Categorical(titanic_nuevo["alone"])

In [ ]:
titanic_nuevo2.head(5)

  sobrevivientes clase  genero estado
0              0     3    male  False
1              1     1  female  False
2              1     3  female   True
3              1     1  female  False
4              0     3    male   True

In [ ]:
#tablas multidimensionales
#tablas de frecuencia cruzadas agrupadas

#Las variables tienen que que ser categóricas

def tablas_frecuencia(variablefila,listaVariablesColumnas):
  
  import pandas as pd #importamos la biblioteca de pandas por si acaso no lo hemos hecho
  
  #creamos la tabla con las columnas que queremos graficar
  tab_10=pd.crosstab( 
        index=variablefila, #variable para las filas
        columns=listaVariablesColumnas, #variables para las columnas
        margins=True #que ponga los totales como "All"            
                      )
  #cambiar nombres de los totales
  tab_10 = tab_10.rename(columns = {"All":"total_filas"})
  tab_10 = tab_10.rename(index = {"All":"total_columnas"})

  frecuencia_absoluta=tab_10 #colocamos nuestra trabla 10 (frecuencias absolutas ) en la variable frecuencia_absoluta


  ####################################  frecuencias relativas marginales ############################

  tab_11=tab_10/tab_10.loc["total_columnas"]*100
  frecuencia_relativa_marginal_columna=tab_11.round(1)

  tab_12=tab_10.T/tab_10["total_filas"]*100
  frecuencia_relativa_marginal_fila=tab_12.T.round(1)

  ########   A ############### B ################################### C #########################
  return frecuencia_absoluta,frecuencia_relativa_marginal_columna,frecuencia_relativa_marginal_fila

In [ ]:
fila=titanic_nuevo2.sobrevivientes #tiene que estar escrita en formato dataFrame.variable
columnas=[titanic_nuevo2.genero,titanic_nuevo2.clase] #tiene que ser las variables en formato de lista

frec_ab, frec_re_mg_col, frec_re_mg_fil =tablas_frecuencia(fila,columnas)

In [ ]:
frec_ab

genero         female          male           total_filas
clase               1   2    3    1    2    3
sobrevivientes
0                   3   6   72   77   91  300         549
1                  91  70   72   45   17   47         342
total_columnas     94  76  144  122  108  347         891

In [ ]:
#tablas multidimensionales
#tablas de frecuencia cruzadas agrupadas

#Frecuencias Relativas absolutas

import pandas as pd

tab_10=pd.crosstab(
    index=titanic_nuevo2["sobrevivientes"], #poner el nombre de la variable que van a ir en las filas
    columns=[titanic_nuevo2["genero"],titanic_nuevo2["clase"]], #nombre de las variables que va a ir en las columnas
    margins=True             
                   )
print("Tabla de frecuencias absolutas original \n\n",tab_10,"\n\n")

####################################  Cambiar nombres ############################

'''

tab_10.index=["finado","vivo", "total_columnas"] #nuevos nombres filas
#cambiar nombre
tab_10.columns=["f1","f2", "f3","m1","m2", "m3","total_filas"] #nuevos nombres columnas


print("Tabla de frecuencias absolutas \n\n",tab_10,"\n\n")
'''

####################################  frecuencias relativas globales ############################

'''
tab_11=tab_10/tab_10.loc["total_columnas","total_filas"]*100

print("Tabla de frecuencias relativas globales \n\n",tab_11.round(1))
'''

Tabla de frecuencias absolutas original

 genero         female          male            All
clase               1   2    3    1    2    3
sobrevivientes
0                   3   6   72   77   91  300  549
1                  91  70   72   45   17   47  342
All                94  76  144  122  108  347  891

'\ntab_11=tab_10/tab_10.loc["total_columnas","total_filas"]*100\n\nprint("Tabla de frecuencias relativas globales \n\n",tab_11.round(1))\n'